// Обʼєкт у JavaScript — це структура,
// яка зберігає дані у форматі
// "ключ: значення".

// --------------------------------
// Приклад:
const user = {
  name: "Anna",
  age: 25,
};

// name і age — це ключі
// "Anna" і 25 — це значення
// --------------------------------
// Простими словами:

// Обʼєкт — це як коробка з даними, де
// кожне значення має свою назву.
// --------------------------------
// Як отримати значення:

user.name; // "Anna"
// або
user["age"]; // 25
// --------------------------------
// Обʼєкти можуть мати методи:

const user1 = {
  name: "Anna",
  sayHi() {
    console.log("Hello");
  },
};
