// Closure — це коли функція
// памʼятає змінні зі свого
// зовнішнього оточення.

// -------------------------------------------
// Простими словами:

// Функція запамʼятовує дані,
// навіть якщо вони вже поза її межами.
// -------------------------------------------
// Приклад:

function outer() {
  let count = 0;

  return function inner() {
    count++;
    console.log(count);
  };
}

const counter = outer();

counter(); // 1
counter(); // 2
counter(); // 3

// Змінна count знаходиться в outer,
// але функція inner продовжує
// її памʼятати.

// -------------------------------------------
// Де це використовується:

// Closure використовується:

// у лічильниках
// у функціях з приватними змінними
// у React (хуки)
// -------------------------------------------
// Підсумок:

// Closure — це те, що дозволяє
// функціям памʼятати дані.
// -------------------------------------------

// Пиши в коментарях, що хочеш побачити в
// наступному відео.
