// 1. Проблема
const user = { name: "Anna" };
const copy = user;

// Тобто user і copy — це дві змінні,
// які вказують на одну й ту
// саму область памʼяті

copy.name = "Oleg";

// Що буде?
console.log(user.name); // "Oleg"

// Ми не створили копію, а просто
// передали посилання.

//---------------------------------
// Простими словами:

// Обʼєкти в JavaScript копіюються по
// посиланню, а не по значенню.
//---------------------------------
// Правильний спосіб — spread:

const user1 = { name: "Anna" };

const copy1 = { ...user1 };
// Ми створили новий обʼєкт
// за допомогою spread.

copy1.name = "Oleg";

// Тепер:
console.log(user.name); // "Anna"
// оригінальний обєкт user1
// не змінюється

// -------------------------------
// Підсумок:
// Обʼєкти в JavaScript копіюються
// за посиланням. Тому присвоєння
// створює не копію,а той самий обʼєкт.
// Щоб зробити копію, використовуйте
// spread (...).
